quote-editor/app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."id" DESC
---
  def index
    @quotes = Quote.ordered

INSERT INTO "quotes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "aaa"], ["created_at", "2024-07-13 00:32:44.567075"], ["updated_at", "2024-07-13 00:32:44.567075"]]
---
  def create
    @quote = Quote.new(quote_params)
    if @quote.save

UPDATE "quotes" SET "name" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["name", "aaatest3"], ["updated_at", "2024-07-14 05:32:50.621547"], ["id", 908005742]]
---
  def update
    if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 908005742]]
---
  def destroy
    @quote.destroy