sandbox/app/models/cart_item.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]
---
  scope :list, -> { includes(:product).order(:id) }

SELECT "cart_items".* FROM "cart_items"
---
    def total_price
      all.sum(&:total_item_price)