sandbox/app/controllers/cart_items_controller.rb

  def create
    @cart_item = CartItem.build_to_append(cart_item_params)

    respond_to do |format|
      if @cart_item.save
---
INSERT INTO "cart_items" ("product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["quantity", 1], ["created_at", "2024-10-28 07:25:39.387597"], ["updated_at", "2024-10-28 07:25:39.387597"]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 3], ["updated_at", "2024-10-28 07:39:26.038642"], ["id", 1]]

  def update
    respond_to do |format|
      if @cart_item.update(cart_item_params)
---
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2024-10-28 23:32:12.230728"], ["id", 3]]

  def destroy
    @cart_item.destroy!
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 2]]

    def set_cart_item
      @cart_item = CartItem.find(params[:id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]