sandbox/app/views/cart_items/update.turbo_stream.erb

UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 11], ["updated_at", "2024-11-01 07:53:53.709926"], ["id", 8]]
---
<%= turbo_stream.update "cart_items_total_price" do %>